In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats

In [2]:
import os
os.getcwd()
os.chdir(r'/Users/siwoolchoi/Desktop/siwooly/대학원/통계와확률/data/')

8.1 모집단 평균의 추정 (모집단 분산이 알려진 경우)

In [3]:
lloyds = pd.read_excel('lloyds.xlsx')
lloyds

    Amount Spent
0             72
1             91
2             74
3            115
4             71
..           ...
95            86
96            95
97            57
98            71
99            84

[100 rows x 1 columns]

In [4]:
lloyds.head()

   Amount Spent
0            72
1            91
2            74
3           115
4            71

In [5]:
lloyds.tail()

    Amount Spent
95            86
96            95
97            57
98            71
99            84

In [6]:
rv = stats.norm(0,1)

In [7]:
n = len(lloyds['Amount Spent'])
n

100

In [8]:
sample_mean = lloyds['Amount Spent'].mean()
sample_mean

np.float64(82.0)

In [9]:
# 모집단 표준편차가 주어짐
std = 20

In [10]:
# 95% 신뢰구간
# 오른쪽 z값 = 오른쪽 면적이(1-0.95)/2 = 0.025이 되는 x축의 값
# 통계량 (x축의 값) 왼쪽 면적 : cdf (누적분포함수)
# 통계량 (x축의 값) 오른쪽 면적 : sf (생존함수)
# 왼쪽 면적의 경계선이 되는 통계량 : ppf (percent point function)
# 오른쪽 면적의 경계선이 되는 통계량 : isf (inverse survival function)

rv.isf(0.025).round(2)

np.float64(1.96)

In [12]:
se_sample_mean = std / np.sqrt(n)
se_sample_mean

np.float64(2.0)

In [13]:
# 오차한계 (E)
e = rv.isf(0.025) * se_sample_mean
e

np.float64(3.919927969080109)

In [15]:
# 95% 신뢰구간의 상한 upper confidence limit
# 95% 신뢰구간의 하한 lower confidence limit

lcl = sample_mean - e
ucl = sample_mean + e

lcl.round(2), ucl.round(2)

(np.float64(78.08), np.float64(85.92))